//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "stdafx.h"		// Для правильной линковки
#include "D3ex.h"
//---------------------------------------------------------------------------
//								ФУНКЦИИ
//---------------------------------------------------------------------------
float D3ex::D3DXVec3Dot(D3DXVECTOR3* Vec1,D3DXVECTOR3* Vec2)
{
	// Скалярное произведение двух векторов.
	// Дополнительные проверки на >1 и <1 нужны т.к. стандартная функция D3DXVec3Dot
	// иногда возвращает значения выходящие за эти пределы
float Dot = ::D3DXVec3Dot(Vec1,Vec2);
if(Dot>1.0) Dot = 1.0;
if(Dot<-1.0) Dot = -1.0;
return Dot;
}
//---------------------------------------------------------------------------
