#pragma once
//---------------------------------------------------------------------------
#ifndef D3exH
#define D3exH
//---------------------------------------------------------------------------
#include "d3dx9math.h"	// Для использования математических функций D3DX9
//---------------------------------------------------------------------------
// Расширение стандартной библиотеки D3DX
//---------------------------------------------------------------------------
namespace D3ex
{
	// Переменные
	
	// Функции
	float D3DXVec3Dot(D3DXVECTOR3* Vec1,D3DXVECTOR3* Vec2);
};
#endif
//---------------------------------------------------------------------------