#pragma once
//---------------------------------------------------------------------------
#ifndef LogFileH
#define LogFileH
//---------------------------------------------------------------------------
#include <string>	// Для использования std::string
#include <stdio.h>	// Для чтения-записи файлов
//---------------------------------------------------------------------------
// Класс для ведения текстового Log-файла
//---------------------------------------------------------------------------
class LogFile
{
protected:

private:

public:
	LogFile(void);	// Конструктор класса
	~LogFile();		// Деструктор класса

	// Переменные
	std::string File;	// Путь к файлу с логом
	
	// Функции
	bool Add(std::string String);	// Добавление записи String в ЛОГ-файл
	bool Clear();   // Удаление всех записей из ЛОГа

};
#endif
//---------------------------------------------------------------------------