//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "stdafx.h"		// Для правильной линковки
#include "LogFile.h"
//---------------------------------------------------------------------------
LogFile::LogFile(void)
{
	// Конструктор класса
File = "C:\\Log.txt";
}
//---------------------------------------------------------------------------
LogFile::~LogFile()
{
	// Деструктор класса

}
//---------------------------------------------------------------------------
bool LogFile::Clear()
{
        // Удаление всех записей из ЛОГа
FILE *F;
if(fopen_s(&F,File.c_str(),"w")==NULL) {
	fclose(F);
}
return true;
}//---------------------------------------------------------------------------
bool LogFile::Add(std::string String)
{
	// Добавление строки в ЛОГ
if(String!="") {
	String += "\n";	// Добавить перенос строки
	FILE *F;
	if(fopen_s(&F,File.c_str(),"ab")==NULL) {
		fwrite(String.c_str(),String.size(),1,F);
		fclose(F);
	}
}
return true;
}
//---------------------------------------------------------------------------
