#pragma once
//---------------------------------------------------------------------------
#ifndef UnicIdH
#define UnicIdH
//---------------------------------------------------------------------------
// Уникальный идентификатор
//---------------------------------------------------------------------------
class UnicId
{
private:
	// Переменные
	static unsigned int Uid;	// Уникальный Id

protected:

public:
	UnicId(void);	// Конструктор класса
	~UnicId();		// Деструктор класса

	// Переменные

	// Функции
	static unsigned int GetUid();	// Возвращает UID
};
//---------------------------------------------------------------------------
#endif