//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "stdafx.h"		// Для правильной линковки
#include "WfCommon.h"
//---------------------------------------------------------------------------
WfCommon::WfCommon(void) {
        // Конструктор класса

}
//---------------------------------------------------------------------------
WfCommon::~WfCommon() {
        // Деструктор класса

}
//---------------------------------------------------------------------------
//								ПРЕОБРАЗОВАНИЯ
//---------------------------------------------------------------------------
std::string WfCommon::IntToStr(int Value) {
	// Преобразование int в std::string
char Buff[12];	// int = X XXX XXX XXX + знак + конец строки
_itoa_s(Value,Buff,12,10);	// Значение в буфер в десятичной системе
Buff[11] = 0;	// Конец строки
return std::string(Buff);
}
//---------------------------------------------------------------------------
int WfCommon::StrToInt(std::string String) {
	// Преобразование std::string в int
return atoi(String.c_str());
}
//---------------------------------------------------------------------------
//								РАБОТА С ФАЙЛАМИ
//---------------------------------------------------------------------------
bool WfCommon::FileExists(std::string File) {
	// Проверка файла на существование. Если файл существует
	// возвращает true
FILE *F;
if(fopen_s(&F,File.c_str(),"r")==NULL) {
	fclose(F);
	return true;
}
return false;
}
//---------------------------------------------------------------------------
std::string WfCommon::GetPath(std::string FullFileName) {
	// От имени файла с путем возвращает только путь
return FullFileName.substr(0,FullFileName.find_last_of("\\",FullFileName.length()));
}
//---------------------------------------------------------------------------